{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "import importlib\n",
    "import movies\n",
    "import data_describe\n",
    "import os\n",
    "\n",
    "importlib.reload(movies)\n",
    "\n",
    "MoviesKG = movies.MoviesKG\n",
    "DataDescribe = data_describe.DataDescribe"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'label': 'Movie', 'node_count': 1967},\n",
       " {'label': 'Genre', 'node_count': 19},\n",
       " {'label': 'ProductionCompany', 'node_count': 2611},\n",
       " {'label': 'Country', 'node_count': 54},\n",
       " {'label': 'Person', 'node_count': 17540},\n",
       " {'label': 'User', 'node_count': 100}]"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# # 创建实例并保存数据到JSON文件\n",
    "# movies_kg = MoviesKG(download=True)\n",
    "# movies_kg.save_to_json()\n",
    "\n",
    "movies_kg = MoviesKG()\n",
    "# movies_kg.clear_database()\n",
    "# movies_kg.filter_data()\n",
    "# movies_kg.build_graph()\n",
    "movies_kg.get_node_counts_by_label()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain_core.prompts.prompt import PromptTemplate\n",
    "import string\n",
    "\n",
    "\n",
    "class FormatDict(dict):\n",
    "    def __missing__(self, key):\n",
    "        return \"{\" + key + \"}\"\n",
    "\n",
    "\n",
    "### default template\n",
    "# CYPHER_GENERATION_TEMPLATE = \"\"\"Task:Generate Cypher statement to query a graph database.\n",
    "# Instructions:\n",
    "# Use only the provided relationship types and properties in the schema.\n",
    "# Do not use any other relationship types or properties that are not provided.\n",
    "# Schema:\n",
    "# {schema}\n",
    "# Note: Do not include any explanations or apologies in your responses.\n",
    "# Do not respond to any questions that might ask anything else than for you to construct a Cypher statement.\n",
    "# Do not include any text except the generated Cypher statement.\n",
    "\n",
    "# The question is:\n",
    "# {question}\"\"\"\n",
    "\n",
    "###\n",
    "CYPHER_GENERATION_TEMPLATE = \"\"\"\n",
    "Task: Generate Cypher statement to query a graph database with fuzzy search.\n",
    "Instructions:\n",
    "Use only the provided relationship types and properties in the schema.\n",
    "Do not use any other relationship types or properties that are not provided.\n",
    "Schema:\n",
    "{schema}\n",
    "Use a similarity threshold of {similarity_threshold} for the levenshteinSimilarity function when matching string fields.\n",
    "Do not include any explanations or apologies in your responses.\n",
    "Do not respond to any questions that might ask anything else than for you to construct a Cypher statement.\n",
    "Do not include any text except the generated Cypher statement.\n",
    "\n",
    "Examples:\n",
    "question: Who starred in 'The Dark Knight'?\n",
    "response: MATCH (p:Person)-[:ACTED_IN]->(m:Movie) WHERE apoc.text.levenshteinSimilarity(m.title, 'The Dark Knight') >= {similarity_threshold} RETURN p.name;\n",
    "\n",
    "question: Which movies did Christopher Nolan direct?\n",
    "response: MATCH (d:Director)-[:DIRECTOR]->(m:Movie) WHERE apoc.text.levenshteinSimilarity(d.name, 'Christopher Nolan') >= {similarity_threshold} RETURN m.title;\n",
    "\n",
    "question: What other films has the director of 'The Dark Knight' directed?\n",
    "response: MATCH (m:Movie) WHERE apoc.text.levenshteinSimilarity(m.title, 'The Dark Knight') >= {similarity_threshold} MATCH (m)<-[:DIRECTOR]-(p:Person)-[:DIRECTOR]->(otherMovies:Movie) RETURN otherMovies.title\n",
    "\n",
    "question: Which movies did user born in year 2001 like?\n",
    "response: MATCH (u:User)-[:LIKED]->(m:Movie) WHERE u.birthYear = 2001 RETURN m.title;\n",
    "\n",
    "question: Where do user who like the director Christopher Nolan live?\n",
    "response: MATCH (u:User)-[:LIKED]->(:Movie)<-[:DIRECTOR]-(d:Director) WHERE apoc.text.levenshteinSimilarity(d.name, 'Christopher Nolan') >= {similarity_threshold} RETURN u.location;\n",
    "\n",
    "The question is:\n",
    "{question}\n",
    "\"\"\"\n",
    "formatter = string.Formatter()\n",
    "\n",
    "CYPHER_GENERATION_TEMPLATE = formatter.vformat(\n",
    "    CYPHER_GENERATION_TEMPLATE, (), FormatDict(similarity_threshold=0.9)\n",
    ")\n",
    "\n",
    "\n",
    "CYPHER_GENERATION_PROMPT = PromptTemplate(\n",
    "    input_variables=[\"schema\", \"question\"], template=CYPHER_GENERATION_TEMPLATE\n",
    ")\n",
    "\n",
    "### default template\n",
    "\n",
    "\n",
    "# CYPHER_QA_TEMPLATE = \"\"\"You are an assistant that helps to form nice and human understandable answers.\n",
    "# The information part contains the provided information that you must use to construct an answer.\n",
    "# The provided information is authoritative, you must never doubt it or try to use your internal knowledge to correct it.\n",
    "# Make the answer sound as a response to the question. Do not mention that you based the result on the given information.\n",
    "# Here is an example:\n",
    "\n",
    "# Question: Which managers own Neo4j stocks?\n",
    "# Context:[manager:CTL LLC, manager:JANE STREET GROUP LLC]\n",
    "# Helpful Answer: CTL LLC, JANE STREET GROUP LLC owns Neo4j stocks.\n",
    "\n",
    "# Follow this example when generating answers.\n",
    "# If the provided information is empty, say that you don't know the answer.\n",
    "# Information:\n",
    "# {context}\n",
    "\n",
    "# Question: {question}\n",
    "# Helpful Answer:\"\"\"\n",
    "\n",
    "CYPHER_QA_TEMPLATE = \"\"\"\n",
    "You are an assistant that helps to form nice and human understandable answers.\n",
    "The information part contains the provided information that you must use to construct an answer.\n",
    "The provided information is authoritative, you must never doubt it or try to use your internal knowledge to correct it.\n",
    "Make the answer sound as a response to the question. Do not mention that you based the result on the given information.\n",
    "\n",
    "Examples:\n",
    "Question: Which managers own Neo4j stocks?\n",
    "Context:[manager:CTL LLC, manager:JANE STREET GROUP LLC]\n",
    "Helpful Answer: CTL LLC, JANE STREET GROUP LLC owns Neo4j stocks.\n",
    "\n",
    "Question: Which movies did user born in year 2001 like?\n",
    "Context:[{{'m.title': 'Avengers 5'}}, {{'m.title': 'The Twilight Saga: New Moon'}}, {{'m.title': 'Rocky'}}]\n",
    "Helpful Answer: The movies that a user born in 2001 liked include 'Avengers 5', 'The Twilight Saga: New Moon' and 'Rocky'.\n",
    "\n",
    "Follow this example when generating answers.\n",
    "If the provided information is empty, say that you don't know the answer.\n",
    "Information:\n",
    "{context}\n",
    "\n",
    "Question: {question}\n",
    "Helpful Answer:\n",
    "\"\"\"\n",
    "\n",
    "\n",
    "CYPHER_QA_PROMPT = PromptTemplate(\n",
    "    input_variables=[\"context\", \"question\"], template=CYPHER_QA_TEMPLATE\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain_community.chat_models import ChatZhipuAI\n",
    "from langchain.chains import GraphCypherQAChain\n",
    "from langchain_community.graphs import Neo4jGraph\n",
    "\n",
    "llm = ChatZhipuAI(\n",
    "    temperature=0,\n",
    "    zhipuai_api_key=os.getenv(\"ZHIPUAI_API_KEY\"),\n",
    "    model_name=\"GLM-4-0520\",\n",
    "    # model_name=\"GLM-4-Flash\",\n",
    ")\n",
    "graph = Neo4jGraph(\n",
    "    url=\"bolt://localhost:7687\", username=\"neo4j\", password=os.getenv(\"NEO4J_PASSWORD\")\n",
    ")\n",
    "chain = GraphCypherQAChain.from_llm(\n",
    "    llm,\n",
    "    cypher_prompt=CYPHER_GENERATION_PROMPT,\n",
    "    qa_prompt=CYPHER_QA_PROMPT,\n",
    "    graph=graph,\n",
    "    verbose=True,\n",
    ")\n",
    "\n",
    "\n",
    "def get_answer(question, choice=\"\"):\n",
    "    if choice:\n",
    "        return chain.invoke(choice)[\"result\"]\n",
    "    return chain.invoke(question)[\"result\"]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "metadata": {},
   "outputs": [],
   "source": [
    "# movies_kg.add_user_preferences()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Node properties:\n",
      "Movie {budget: INTEGER, id: INTEGER, title: STRING, tagline: STRING, belongs_to_collection: STRING, runtime: INTEGER, overview: STRING, revenue: INTEGER, release_date: STRING}\n",
      "Genre {name: STRING}\n",
      "ProductionCompany {origin_country: STRING, name: STRING, id: INTEGER}\n",
      "Country {name: STRING}\n",
      "Person {name: STRING, id: INTEGER, gender: INTEGER}\n",
      "User {birthYear: INTEGER, location: STRING, name: STRING, id: INTEGER, gender: STRING}\n",
      "Relationship properties:\n",
      "ACTED_IN {character: STRING}\n",
      "The relationships:\n",
      "(:Movie)-[:BELONGS_TO_GENRE]->(:Genre)\n",
      "(:Movie)-[:PRODUCED_BY]->(:ProductionCompany)\n",
      "(:Movie)-[:ORIGIN_COUNTRY]->(:Country)\n",
      "(:Person)-[:PRODUCER]->(:Movie)\n",
      "(:Person)-[:EXECUTIVE_PRODUCER]->(:Movie)\n",
      "(:Person)-[:DIRECTOR]->(:Movie)\n",
      "(:Person)-[:ACTED_IN]->(:Movie)\n",
      "(:User)-[:HATED]->(:Movie)\n",
      "(:User)-[:DISLIKED]->(:Movie)\n",
      "(:User)-[:LOVED]->(:Movie)\n",
      "(:User)-[:IGNORED]->(:Movie)\n",
      "(:User)-[:LIKED]->(:Movie)\n"
     ]
    }
   ],
   "source": [
    "print(graph.get_schema)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 57,
   "metadata": {},
   "outputs": [],
   "source": [
    "from enum import Enum\n",
    "\n",
    "\n",
    "class QUESTION(str, Enum):\n",
    "    # 简单单跳问题\n",
    "    Q11 = \"Who starred in 'The Dark Knight'?\"\n",
    "    Q12 = \"Who directed 'The Dark Knight'?\"\n",
    "    Q13 = \"Which movies did Christopher Nolan direct?\"\n",
    "    Q14 = \"Which movies did Christopher Noran direct?\"\n",
    "\n",
    "    # 添加筛选条件\n",
    "    Q21 = (\n",
    "        \"Besides 'The Dark Knight', which other movies has Christopher Nolan directed?\"\n",
    "    )\n",
    "    Q22 = \"In which movies have Michael Caine and Maggie Gyllenhaal co-starred?\"\n",
    "\n",
    "    Q31 = \"What other films has the director of 'Kingdom of the Planet of the Apes' directed?\"\n",
    "    Q32 = \"What other films has the director of 'Kingdon of the Planett of the Apes' directed?\"\n",
    "    Q33 = \"What other films has the director of 'Kingdom of the Apes' directed?\"\n",
    "    Q34 = \"What is the revenue of 'Kingdom of the Planet of the Apes'?\"\n",
    "\n",
    "\n",
    "default_questions = [question.value for question in QUESTION]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 58,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (m:Movie) WHERE apoc.text.levenshteinSimilarity(m.title, 'Kingdon of the Planett of the Apes') >= 0.9 MATCH (m)<-[:DIRECTOR]-(p:Person)-[:DIRECTOR]->(otherMovies:Movie) RETURN otherMovies.title\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'otherMovies.title': 'Maze Runner: The Death Cure'}, {'otherMovies.title': 'Maze Runner: The Scorch Trials'}, {'otherMovies.title': 'The Maze Runner'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "The director of 'Kingdom of the Planet of the Apes' has also directed 'Maze Runner: The Death Cure', 'Maze Runner: The Scorch Trials', and 'The Maze Runner'.\n"
     ]
    }
   ],
   "source": [
    "print(get_answer(QUESTION.Q32.value))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 49,
   "metadata": {},
   "outputs": [],
   "source": [
    "# for question in default_questions:\n",
    "#     print(question)\n",
    "#     print(get_answer(question))\n",
    "#     print(\"--------------------------------------------------------\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 50,
   "metadata": {},
   "outputs": [],
   "source": [
    "class RecommendationQuestions(str, Enum):\n",
    "    Q1 = \"Which directors does User 5 love?\"\n",
    "\n",
    "    Q21 = \"Which movies did user born in year 2001 like?\"\n",
    "    Q22 = \"Which movies did user born in year 1996 like?\"\n",
    "    Q31 = \"Which films should person born in year 1972 not watch?\"\n",
    "\n",
    "    Q3 = \"Which user likes the director Christopher Nolan's films?\"\n",
    "\n",
    "    Q40 = \"What are the films that people like, give 10 films with their directors?\"\n",
    "    Q41 = \"Where do user who like the director Christopher Nolan live?\"\n",
    "    Q42 = \"Where do people who like the director Yorgos Lanthimos live?\"\n",
    "\n",
    "    Q5 = \"What is the gender distribution of users who love films?\"\n",
    "\n",
    "    Q6 = \"Who are the people that liked Action, Adventure films?\"\n",
    "\n",
    "\n",
    "user_questions = [question.value for question in RecommendationQuestions]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 51,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (u:User)-[:LIKED]->(:Movie)<-[:DIRECTOR]-(d:Person) WHERE apoc.text.levenshteinSimilarity(d.name, 'Yorgos Lanthimos') >= 0.9 RETURN u.location;\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'u.location': 'Australia'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "People who like the director Yorgos Lanthimos live in Australia.\n"
     ]
    }
   ],
   "source": [
    "print(get_answer(RecommendationQuestions.Q42.value))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 52,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Which directors does User 5 love?\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (u:User {id: 5})-[:LOVED]->(:Movie)<-[:DIRECTOR]-(d:Person) RETURN d.name;\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'d.name': 'David Gregory'}, {'d.name': 'Olivier Megaton'}, {'d.name': 'Katsuhiko Fujii'}, {'d.name': 'Lee Isaac Chung'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "User 5 loves the directors David Gregory, Olivier Megaton, Katsuhiko Fujii, and Lee Isaac Chung.\n",
      "--------------------------------------------------------\n",
      "Which movies did user born in year 2001 like?\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (u:User)-[:LIKED]->(m:Movie) WHERE u.birthYear = 2001 RETURN m.title;\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'m.title': 'Avengers 5'}, {'m.title': 'The Twilight Saga: New Moon'}, {'m.title': 'Rocky'}, {'m.title': 'Triangle'}, {'m.title': 'The Dark Kingdom'}, {'m.title': 'Saw IV'}, {'m.title': 'The SpongeBob Movie: Sponge on the Run'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "The movies that a user born in 2001 liked include 'Avengers 5', 'The Twilight Saga: New Moon', 'Rocky', 'Triangle', 'The Dark Kingdom', 'Saw IV', and 'The SpongeBob Movie: Sponge on the Run'.\n",
      "--------------------------------------------------------\n",
      "Which movies did user born in year 1996 like?\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (u:User)-[:LIKED]->(m:Movie) WHERE u.birthYear = 1996 RETURN m.title;\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'m.title': 'Murder Mystery'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "The movies that a user born in 1996 liked include 'Murder Mystery'.\n",
      "--------------------------------------------------------\n",
      "Which films should person born in year 1972 not watch?\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (u:User {birthYear: 1972})-[:HATED]->(m:Movie) RETURN m.title;\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "I don't know the answer.\n",
      "--------------------------------------------------------\n",
      "Which user likes the director Christopher Nolan's films?\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (u:User)-[:LIKED]->(:Movie)<-[:DIRECTOR]-(d:Person) WHERE apoc.text.levenshteinSimilarity(d.name, 'Christopher Nolan') >= 0.9 RETURN u.name;\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'u.name': 'User 53'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "User 53 likes the director Christopher Nolan's films.\n",
      "--------------------------------------------------------\n",
      "What are the films that people like, give 10 films with their directors?\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (u:User)-[:LIKED]->(m:Movie)<-[:DIRECTOR]-(d:Person)\n",
      "WITH m, d, COUNT(*) as likes\n",
      "ORDER BY likes DESC\n",
      "LIMIT 10\n",
      "RETURN m.title, d.name;\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'m.title': 'Life', 'd.name': 'Daniel Espinosa'}, {'m.title': 'Life', 'd.name': 'Ted Demme'}, {'m.title': 'Lolita', 'd.name': 'Stanley Kubrick'}, {'m.title': 'Anatomy of a Fall', 'd.name': 'Justine Triet'}, {'m.title': 'Art of Love', 'd.name': 'Recai Karagöz'}, {'m.title': 'The SpongeBob Movie: Sponge on the Run', 'd.name': 'Tim Hill'}, {'m.title': 'Bad Boys', 'd.name': 'Michael Bay'}, {'m.title': 'Bad Boys', 'd.name': 'Rick Rosenthal'}, {'m.title': 'Escape from Hell', 'd.name': 'Edoardo Mulargia'}, {'m.title': 'Lolita', 'd.name': 'Adrian Lyne'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "Here are 10 films that people like along with their directors: \n",
      "\n",
      "1. 'Life' directed by Daniel Espinosa\n",
      "2. 'Life' directed by Ted Demme\n",
      "3. 'Lolita' directed by Stanley Kubrick\n",
      "4. 'Anatomy of a Fall' directed by Justine Triet\n",
      "5. 'Art of Love' directed by Recai Karagöz\n",
      "6. 'The SpongeBob Movie: Sponge on the Run' directed by Tim Hill\n",
      "7. 'Bad Boys' directed by Michael Bay\n",
      "8. 'Bad Boys' directed by Rick Rosenthal\n",
      "9. 'Escape from Hell' directed by Edoardo Mulargia\n",
      "10. 'Lolita' directed by Adrian Lyne\n",
      "--------------------------------------------------------\n",
      "Where do user who like the director Christopher Nolan live?\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (u:User)-[:LIKED]->(:Movie)<-[:DIRECTOR]-(d:Person) WHERE apoc.text.levenshteinSimilarity(d.name, 'Christopher Nolan') >= 0.9 RETURN u.location;\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'u.location': 'USA'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "The user who likes the director Christopher Nolan lives in the USA.\n",
      "--------------------------------------------------------\n",
      "Where do people who like the director Yorgos Lanthimos live?\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (u:User)-[:LIKED]->(:Movie)<-[:DIRECTOR]-(d:Person) WHERE apoc.text.levenshteinSimilarity(d.name, 'Yorgos Lanthimos') >= 0.9 RETURN u.location;\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'u.location': 'Australia'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "People who like the director Yorgos Lanthimos live in Australia.\n",
      "--------------------------------------------------------\n",
      "What is the gender distribution of users who love films?\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (u:User)-[:LOVED]->(m:Movie) RETURN u.gender, count(*) as count;\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'u.gender': 'Male', 'count': 56}, {'u.gender': 'Female', 'count': 65}, {'u.gender': 'Other', 'count': 89}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "The gender distribution of users who love films is 56 males, 65 females, and 89 who identify as other.\n",
      "--------------------------------------------------------\n",
      "Who are the people that liked Action, Adventure films?\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (u:User)-[:LIKED]->(m:Movie)-[:BELONGS_TO_GENRE]->(g:Genre) WHERE g.name IN ['Action', 'Adventure'] RETURN u.name;\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'u.name': 'User 5'}, {'u.name': 'User 6'}, {'u.name': 'User 6'}, {'u.name': 'User 8'}, {'u.name': 'User 8'}, {'u.name': 'User 9'}, {'u.name': 'User 10'}, {'u.name': 'User 11'}, {'u.name': 'User 12'}, {'u.name': 'User 12'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "The people that liked Action, Adventure films include User 5, User 6, User 8, User 9, User 10, User 11, and User 12.\n",
      "--------------------------------------------------------\n"
     ]
    }
   ],
   "source": [
    "for question in user_questions:\n",
    "    print(question)\n",
    "    print(get_answer(question))\n",
    "    print(\"--------------------------------------------------------\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "拒绝回答的例子\n",
    "\n",
    "```p\n",
    "Which films should person born in year 1972 not watch?\n",
    "\n",
    "\n",
    "> Entering new GraphCypherQAChain chain...\n",
    "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: DEPRECATION} {title: This feature is deprecated and will be removed in future versions.} {description: The semantics of using colon in the separation of alternative relationship types will change in a future version. (Please use ':HATED|DISLIKED' instead)} {position: line: 1, column: 41, offset: 40} for query: 'MATCH (u:User {birthYear: 1972})-[:HATED|:DISLIKED]->(m:Movie) RETURN m.title;'\n",
    "Generated Cypher:\n",
    "MATCH (u:User {birthYear: 1972})-[:HATED|:DISLIKED]->(m:Movie) RETURN m.title;\n",
    "Full Context:\n",
    "[{'m.title': 'Mobile Suit Gundam SEED FREEDOM'}, {'m.title': 'Stay'}]\n",
    "\n",
    "> Finished chain.\n",
    "I don't know the answer.\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 53,
   "metadata": {},
   "outputs": [],
   "source": [
    "# import gradio as gr\n",
    "\n",
    "# # Corrected Gradio interface setup\n",
    "# iface = gr.Interface(\n",
    "#     fn=get_answer,\n",
    "#     inputs=[\n",
    "#         gr.Dropdown(\n",
    "#             choices=default_questions,\n",
    "#             label=\"Select a question\",\n",
    "#             value=default_questions[0],\n",
    "#         ),  # 默认选择第一个问题\n",
    "#         gr.Textbox(lines=2, label=\"Or enter your question here...\"),\n",
    "#     ],\n",
    "#     outputs=gr.Textbox(lines=10, label=\"Output\"),  # 增加输出行数\n",
    "#     title=\"GraphCypher QA System\",\n",
    "#     description=\"Ask any question related to the movie database.\",\n",
    "# )\n",
    "\n",
    "\n",
    "# # Launch the Gradio app\n",
    "# iface.launch(share=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 54,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Node properties are the following:\n",
      "Movie {budget: INTEGER, id: INTEGER, title: STRING, tagline: STRING, belongs_to_collection: STRING, runtime: INTEGER, overview: STRING, revenue: INTEGER, release_date: STRING},Genre {name: STRING},ProductionCompany {origin_country: STRING, name: STRING, id: INTEGER},Country {name: STRING},Person {name: STRING, id: INTEGER, gender: INTEGER},User {birthYear: INTEGER, location: STRING, name: STRING, id: INTEGER, gender: STRING}\n",
      "Relationship properties are the following:\n",
      "ACTED_IN {character: STRING}\n",
      "The relationships are the following:\n",
      "(:Movie)-[:BELONGS_TO_GENRE]->(:Genre),(:Movie)-[:PRODUCED_BY]->(:ProductionCompany),(:Movie)-[:ORIGIN_COUNTRY]->(:Country),(:Person)-[:PRODUCER]->(:Movie),(:Person)-[:EXECUTIVE_PRODUCER]->(:Movie),(:Person)-[:DIRECTOR]->(:Movie),(:Person)-[:ACTED_IN]->(:Movie),(:User)-[:HATED]->(:Movie),(:User)-[:DISLIKED]->(:Movie),(:User)-[:LOVED]->(:Movie),(:User)-[:IGNORED]->(:Movie),(:User)-[:LIKED]->(:Movie)\n"
     ]
    }
   ],
   "source": [
    "from langchain_community.chains.graph_qa.cypher import construct_schema\n",
    "\n",
    "schema = construct_schema(graph.get_structured_schema, [], [])\n",
    "print(schema)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "base",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
